In [4]:
import pandas as pd
import duckdb as db

In [5]:
con = db.connect("../../ingestao_de_dados/database/db_distribuicao_profissoes.db")

In [6]:
con.execute("SHOW TABLES").fetchdf()

                          name
0                  etl_estados
1            origens_advogados
2           origens_contadores
3          origens_engenheiros
4           origens_psicologos
5    tbl_advogados_brasil_2024
6   tbl_contadores_brasil_2024
7  tbl_engenheiros_brasil_2024
8           tbl_estados_brasil
9   tbl_psicologos_brasil_2024

In [7]:
tabelas = {
    "advogados": "origens_advogados",
    "contadores": "origens_contadores",
    "engenheiros": "origens_engenheiros",
    "psicologos": "origens_psicologos",
    "estados": "etl_estados"
}

tabela = {nome: con.execute(f"SELECT * FROM {tabela}").fetchdf() for nome, tabela in tabelas.items()}

In [8]:
tabela['advogados']

   Estado  Feminino  Masculino
0      AC      1898       2078
1      AL      7376       7847
2      AM      8181       7544
3      AP      2124       2049
4      BA     33281      28654
5      CE     19541      20292
6      DF     26508      25358
7      ES     14451      13009
8      GO     28562      25229
9      MA     12026      12020
10     MG     74205      69942
11     MS      9500       9505
12     MT     13516      12059
13     PA     15124      13056
14     PB     10665      11491
15     PE     22227      21046
16     PI      8684       9517
17     PR     47022      44869
18     RJ     84602      74423
19     RN      8106       8413
20     RO      5818       5102
21     RR      1473       1398
22     RS     51660      47028
23     SC     27023      25110
24     SE      6955       6370
25     SP    197236     181116
26     TO      4966       4592

In [9]:
tabela['contadores']

   Estado  Masculino  Feminino
0      DF       6407      4512
1      GO       6276      4137
2      MS       2886      2637
3      MT       4241      4037
4      AL       1832      1433
5      BA       9497      7314
6      CE       5587      4375
7      MA       3425      2475
8      PB       2811      2247
9      PE       5904      5094
10     PI       2809      2233
11     RN       3006      2761
12     SE       1469      1313
13     AC        539       512
14     AM       2532      3106
15     AP        743       660
16     PA       5178      5728
17     RO       1882      1719
18     RR        501       551
19     TO       1580      1277
20     ES       4174      4174
21     MG      17903     18568
22     RJ      20288     17855
23     SP      56528     49302
24     PR      15933     12027
25     RS      12378     13618
26     SC       9728      9328

In [10]:
tabela['engenheiros']

     Estado  Feminino  Masculino
0   CREA-AC       710       1892
1   CREA-AL      1677       7159
2   CREA-AM      4236      11833
3   CREA-AP       391       1278
4   CREA-BA     12202      39436
5   CREA-CE      4673      19166
6   CREA-DF      4602      18081
7   CREA-ES      6004      17778
8   CREA-GO      8487      28991
9   CREA-MA      3821      12044
10  CREA-MG     32656     121679
11  CREA-MS      3793      13313
12  CREA-MT      6962      20483
13  CREA-PA      9615      24308
14  CREA-PB      2848      10438
15  CREA-PE      5646      20929
16  CREA-PI      1935       7985
17  CREA-PR     13595      58273
18  CREA-RJ     23618      93569
19  CREA-RN      3361      11362
20  CREA-RO      2123       5258
21  CREA-RR       544       1119
22  CREA-RS     14061      54101
23  CREA-SC     10400      37472
24  CREA-SE      1888       5614
25  CREA-SP     53124     281812
26  CREA-TO      1799       5200

In [11]:
tabela['psicologos']

                 Estado  Feminino  Masculino
0                  Acre      1181        236
1               Alagoas      5399        991
2                 Amapá      1201        261
3              Amazonas      5163        996
4                 Bahia     21113       3559
5                 Ceará     12387       2508
6      Distrito Federal     13246       2407
7        Espírito Santo      7601       1499
8                 Goiás     13638       1966
9              Maranhão      5475       1028
10          Mato Grosso      6371        939
11   Mato Grosso do Sul      5204        789
12         Minas Gerais     48465       9033
13                 Pará      6055       1206
14              Paraíba      6869       1323
15               Paraná     27062       4695
16           Pernambuco     17090       2930
17                Piauí      4005        714
18       Rio de Janeiro     50682       8476
19  Rio Grande do Norte      5605       1186
20    Rio Grande do Sul     27680       4001
21             Rondônia      2743        516
22              Roraima       971        167
23       Santa Catarina     17963       2739
24            São Paulo    132077      22613
25              Sergipe      3372        723
26            Tocantins      2244        373

In [12]:
tabela['estados']

                                   tbl_estados_brasil
0        {'id': 1, 'uf': 'AC', 'nome_estado': 'Acre'}
1     {'id': 2, 'uf': 'AL', 'nome_estado': 'Alagoas'}
2    {'id': 4, 'uf': 'AM', 'nome_estado': 'Amazonas'}
3       {'id': 5, 'uf': 'AP', 'nome_estado': 'Amapá'}
4       {'id': 6, 'uf': 'BA', 'nome_estado': 'Bahia'}
5       {'id': 7, 'uf': 'CE', 'nome_estado': 'Ceará'}
6   {'id': 8, 'uf': 'DF', 'nome_estado': 'Distrito...
7   {'id': 9, 'uf': 'ES', 'nome_estado': 'Espírito...
8      {'id': 10, 'uf': 'GO', 'nome_estado': 'Goiás'}
9   {'id': 11, 'uf': 'MA', 'nome_estado': 'Maranhão'}
10  {'id': 12, 'uf': 'MG', 'nome_estado': 'Minas G...
11  {'id': 13, 'uf': 'MS', 'nome_estado': 'Mato Gr...
12  {'id': 14, 'uf': 'MT', 'nome_estado': 'Mato Gr...
13      {'id': 15, 'uf': 'PA', 'nome_estado': 'Pará'}
14   {'id': 16, 'uf': 'PB', 'nome_estado': 'Paraíba'}
15  {'id': 17, 'uf': 'PE', 'nome_estado': 'Pernamb...
16     {'id': 18, 'uf': 'PI', 'nome_estado': 'Piauí'}
17    {'id': 19, 'uf': 'PR', 'nome_estado': 'Paraná'}
18  {'id': 20, 'uf': 'RJ', 'nome_estado': 'Rio de ...
19  {'id': 21, 'uf': 'RN', 'nome_estado': 'Rio Gra...
20  {'id': 22, 'uf': 'RO', 'nome_estado': 'Rondônia'}
21   {'id': 23, 'uf': 'RR', 'nome_estado': 'Roraima'}
22  {'id': 24, 'uf': 'RS', 'nome_estado': 'Rio Gra...
23  {'id': 25, 'uf': 'SC', 'nome_estado': 'Santa C...
24   {'id': 26, 'uf': 'SE', 'nome_estado': 'Sergipe'}
25  {'id': 27, 'uf': 'SP', 'nome_estado': 'São Pau...
26  {'id': 28, 'uf': 'TO', 'nome_estado': 'Tocantis'}

In [13]:
con.execute("DESCRIBE origens_advogados").fetchdf()
con.execute("DESCRIBE origens_contadores").fetchdf()
con.execute("DESCRIBE origens_engenheiros").fetchdf()
con.execute("DESCRIBE origens_psicologos").fetchdf()

  column_name column_type null   key default extra
0      Estado     VARCHAR  YES  None    None  None
1    Feminino      BIGINT  YES  None    None  None
2   Masculino      BIGINT  YES  None    None  None

In [35]:
query = """
    SELECT *, 'advogado' AS profissao
    FROM origens_advogados

    UNION ALL

    SELECT *, 'contador' AS profissao
    FROM origens_contadores

    UNION ALL

    SELECT *, 'engenheiro' AS profissao
    FROM origens_engenheiros

    UNION ALL

    SELECT *, 'psicologo' AS profissao
    FROM origens_psicologos
"""

In [36]:
df_profissoes = con.execute(query).fetchdf()
df_profissoes

             Estado  Feminino  Masculino  profissao
0                AC      1898       2078   advogado
1                AL      7376       7847   advogado
2                AM      8181       7544   advogado
3                AP      2124       2049   advogado
4                BA     33281      28654   advogado
..              ...       ...        ...        ...
103         Roraima       971        167  psicologo
104  Santa Catarina     17963       2739  psicologo
105       São Paulo    132077      22613  psicologo
106         Sergipe      3372        723  psicologo
107       Tocantins      2244        373  psicologo

[108 rows x 4 columns]

In [37]:
df_profissoes[df_profissoes['profissao'] == 'advogado'].describe()

            Feminino      Masculino
count      27.000000      27.000000
mean    27508.518519   25522.851852
std     39997.618600   36525.059606
min      1473.000000    1398.000000
25%      7741.000000    7695.500000
50%     13516.000000   12059.000000
75%     27792.500000   25293.500000
max    197236.000000  181116.000000

In [38]:
df_profissoes[df_profissoes['profissao'] == 'contador'].describe()

           Feminino     Masculino
count     27.000000     27.000000
mean    7631.000000   6777.518519
std    11128.348709   9851.721413
min      501.000000    512.000000
25%     2207.000000   1976.000000
50%     4174.000000   4037.000000
75%     7952.000000   6521.000000
max    56528.000000  49302.000000

In [39]:
df_profissoes[df_profissoes['profissao'] == 'engenheiro'].describe()

           Feminino      Masculino
count     27.000000      27.000000
mean    8695.222222   34465.666667
std    11525.265271   56973.482517
min      391.000000    1119.000000
25%     2029.000000    7572.000000
50%     4602.000000   17778.000000
75%    10007.500000   33231.500000
max    53124.000000  281812.000000

In [40]:
df_profissoes[df_profissoes['profissao'] == 'psicologo'].describe()

            Feminino     Masculino
count      27.000000     27.000000
mean    16698.592593   2884.222222
std     26513.606301   4540.061041
min       971.000000    167.000000
25%      4584.000000    756.000000
50%      6371.000000   1206.000000
75%     17526.500000   2834.500000
max    132077.000000  22613.000000